from django.urls import path
from . import views

# =========================================================================
# เส้นทางสำหรับหน้าแรกสุดของเว็บไซต์ (Core URLs)
# =========================================================================

# ตั้งชื่อเล่น (Namespace) ให้กับกลุ่ม URL นี้ว่า 'core'
# เวลาระบุใน HTML จะเขียนแบบนี้ได้เลย -> {% url 'core:home' %}
app_name = 'core'

urlpatterns = [
    # เมื่อมีคนเข้าหน้าเว็บหลัก (ไม่มีข้อความต่อท้าย) 
    # ให้วิ่งไปทำงานที่ฟังก์ชันชื่อ home ในไฟล์ views.py
    # และตั้งชื่อเส้นทางนี้ว่า 'home'
    path('', views.home, name='home')
]